#include "buzztt.h"
/*按键和蜂鸣器共同使用*/
/*

	
	4KHZ频率下，2KHZ高（蜂鸣器），2KHZ低（按键输入检测）
*/



volatile uint8_t BUZZTT_Flag = 0;//按键蜂鸣器切换标志位;0为按键，1为蜂鸣器.
uint8_t KEY_Press = 0;
uint8_t KEY_Long_Press = 0;//表示按键长按
/*-------------------------------------------------
 *  函数名BUZZTT_Init
 *	功能：  初始化按键和蜂鸣器
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUZZTT_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  &= ~0B00000010;	//PC输入输出 0-输出 1-输入
    
    PC1 = 0; //先关闭 
}
/*-------------------------------------------------
 *  函数名BUTTON_Init
 *	功能：  初始化按键（输入）
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUTTON_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  |=  0B00000010;	//PC输入输出 0-输出 1-输入
    
    WPUB   |=  0B00000010;	//打开上拉输入
}
/*-------------------------------------------------
 *  函数名BUZZER_Init
 *	功能：  初始化蜂鸣器（输出）
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUZZER_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  &= ~0B00000010;	//PC输入输出 0-输出 1-输入
    
    WPUB   &= ~0B00000010;	//关闭上拉输入
}
/*-------------------------------------------------
 *  函数名BUZZ_Control
 *	功能：  根据标志位切换；1:蜂鸣器；0：按键；
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUZZTT_Control(void)
{
	if(BUZZTT_Flag)
    {
		BUZZER_Init();
    }
    else
    {
		BUTTON_Init();
    }
}
/*-------------------------------------------------
 *  函数名Key_Dected
 *	功能：  按键检测(10ms执行一次),3s长按
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void Key_Dected(void)
{
	static uint8_t num = 0;
    static uint8_t long_num = 0;//长按时间
	if(!BUZZTT_Flag)//在按键状态下
    {
		BUTTON_Init();
		if(!PC1)//按键按下
        {
			if(num<2)//执行两次
            {
				num ++;
            }
            else
            {
				KEY_Press = 1;//表示按键按下
            }
        }
        else//松开按键
        {
			num = 0;
			KEY_Press = 0;
            long_num = 0;
        }
    }
    
    if(KEY_Press)
    {
		if(long_num<LONG_Press_Time)
        {
			long_num++;
        }
        else
        {
			KEY_Long_Press = 1;
			SYS.Long_Time_Change = 0;//导通超时后，按键导通重新计时

        }
    }
}
/*-------------------------------------------------
 *  函数名BUZZER_Dected
 *	功能：  蜂鸣器任务
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	

void BUZZER_Dected(void)
{
	if(BUZZTT_Flag)
    {
		BUZZER_Init();
        PC1 = 1;

    }
}


/*-------------------------------------------------
 *  函数名BUZZTT_Task
 *	功能：  按键和蜂鸣器任务
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	

void BUZZTT_Task(void)
{
	BUZZTT_Control();
    BUZZER_Dected();
	Key_Dected();

}